In [1]:
from pprint import pprint
import pandas as pd
import seaborn as sns
import pymongo
client = pymongo.MongoClient("mongodb+srv://yashmohite:12345678ym@cluster0.urvqe3y.mongodb.net/?retryWrites=true&w=majority")
db = client.test #pointer 
print(db)

Database(MongoClient(host=['ac-d6qyvfk-shard-00-02.urvqe3y.mongodb.net:27017', 'ac-d6qyvfk-shard-00-01.urvqe3y.mongodb.net:27017', 'ac-d6qyvfk-shard-00-00.urvqe3y.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, retrywrites=True, w='majority', authsource='admin', replicaset='atlas-lkhn33-shard-0', tls=True), 'test')

In [2]:
data = pd.read_csv("Data Science Jobs Salaries.csv")

In [6]:
db = client["data_science_job_salary"]

In [7]:
collection = db["records"]

In [8]:
data = data.to_dict(orient="recors")

C:\Users\yash mohite\AppData\Local\Temp\ipykernel_21336\2057312129.py:1: FutureWarning: Using short name for 'orient' is deprecated. Only the options: ('dict', list, 'series', 'split', 'records', 'index') will be used in a future version. Use one of the above to silence this warning.
  data = data.to_dict(orient="recors")

In [10]:
collection.insert_many(data)

In [12]:
df = list(collection.find())

In [14]:
df = pd.DataFrame(df)

In [17]:
df

,_id,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,63fa3f718bb93629ec7d0049,2021e,EN,FT,Data Science Consultant,54000,EUR,64369,DE,50,DE,L
1,63fa3f718bb93629ec7d004a,2020,SE,FT,Data Scientist,60000,EUR,68428,GR,100,US,L
2,63fa3f718bb93629ec7d004b,2021e,EX,FT,Head of Data Science,85000,USD,85000,RU,0,RU,M
3,63fa3f718bb93629ec7d004c,2021e,EX,FT,Head of Data,230000,USD,230000,RU,50,RU,L
4,63fa3f718bb93629ec7d004d,2021e,EN,FT,Machine Learning Engineer,125000,USD,125000,US,100,US,S
...,...,...,...,...,...,...,...,...,...,...,...,...
240,63fa3f718bb93629ec7d0139,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
241,63fa3f718bb93629ec7d013a,2021e,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
242,63fa3f718bb93629ec7d013b,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
243,63fa3f718bb93629ec7d013c,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
244,63fa3f718bb93629ec7d013d,2021e,SE,FT,Data Science Manager,7000000,INR,94917,IN,50,IN,L

In [18]:
df.dtypes

_id                   object
work_year             object
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object